app/controllers/events_controller.rb

INSERT INTO "events" ("description", "date", "place", "created_at", "updated_at", "creator_id") VALUES (?, ?, ?, ?, ?, ?)  [["description", "trop bien 2"], ["date", "2018-05-07 16:05:00"], ["place", "ici"], ["created_at", "2018-05-07 16:23:42.669383"], ["updated_at", "2018-05-07 16:23:42.669383"], ["creator_id", 1]]
---
  def create
    @event = Event.new(event_params)

    user = current_user.id
    @event.creator_id = user

    attendee = current_user.id
    @event.attendee_id = attendee

    respond_to do |format|
      if @event.save

UPDATE "events" SET "description" = ?, "place" = ?, "date" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["description", "trop bienn"], ["place", ""], ["date", "2018-05-07 16:04:00"], ["updated_at", "2018-05-07 16:04:46.928431"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @event.update(event_params)